#+TITLE: 01.Introduction
* 1 Introduction
   :PROPERTIES:
   :CUSTOM_ID: introduction
   :END:
   :LOGBOOK:
   CLOCK: [2020-03-14 Sat 07:19]--[2020-03-14 Sat 08:08] =>  0:49
   :END:

Most of the GNU Emacs text editor is written in the programming language called Emacs Lisp. You can write new code in Emacs Lisp and install it as an extension to the editor. However, Emacs Lisp is more than a mere extension language; it is a full computer programming language in its own right. You can use it as you would any other programming language.

Because Emacs Lisp is designed for use in an editor, it has special features for scanning and parsing text as well as features for handling files, buffers, displays, subprocesses, and so on. Emacs Lisp is closely integrated with the editing facilities; thus, editing commands are functions that can also conveniently be called from Lisp programs, and parameters for customization are ordinary Lisp variables.

This manual attempts to be a full description of Emacs Lisp. For a beginner's introduction to Emacs Lisp, see An Introduction to Emacs Lisp Programming, by Bob Chassell, also published by the Free Software Foundation. This manual presumes considerable familiarity with the use of Emacs for editing; see The GNU Emacs Manual for this basic information.

Generally speaking, the earlier chapters describe features of Emacs Lisp that have counterparts in many programming languages, and later chapters describe features that are peculiar to Emacs Lisp or relate specifically to editing.

This is the GNU Emacs Lisp Reference Manual, corresponding to Emacs version 26.3.

1) [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Caveats][Caveats]]: Flaws and a request for help.
2) [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Lisp-History][Lisp History]]: Emacs Lisp is descended from Maclisp.
3) [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Conventions][Conventions]]: How the manual is formatted.
4) [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Version-Info][Version Info]]: Which Emacs version is running?
5) [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Acknowledgments][Acknowledgments]]: The authors, editors, and sponsors of this manual.

Next: [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Lisp-History][Lisp History]], Up: [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Introduction][Introduction]]

* 1.4 Version Information
    :PROPERTIES:
    :CUSTOM_ID: version-information
    :END:

These facilities provide information about which version of Emacs is in use.

--- Command: *emacs-version* &optional here


  This function returns a string describing the version of Emacs that is running. It is useful to include this string in bug reports.

#+BEGIN_SRC elisp
  (emacs-version)
#+END_SRC

#+RESULTS:
: GNU Emacs 26.3 (build 2, x86_64-pc-linux-gnu, GTK+ Version 3.24.11)
:  of 2019-09-23, modified by Debian

  If here is non-=nil=, it inserts the text in the buffer before point, and returns =nil=. When this function is called interactively, it prints the same information in the echo area, but giving a prefix argument makes here =non-nil=.


--- Variable: *emacs-build-time*


  The value of this variable indicates the time at which Emacs was built. It is a list of four integers, like the value of =current-time= (see [[https://www.gnu.org/software/emacs/manual/html_mono/elisp.html#Time-of-Day][Time of Day]]), or is =nil= if the information is not available.

  #+BEGIN_SRC elisp
 emacs-build-time
                     ⇒ (20614 63694 515336 438000)
  #+END_SRC


--- Variable: *emacs-version*


  The value of this variable is the version of Emacs being run. It is a string such as ="26.1"= . A value with three numeric components, such as ="26.0.91"= , indicates an unreleased test version. (Prior to Emacs 26.1, the string includes an extra final component with the integer that is now stored in =emacs-build-number=; e.g., ="25.1.1"=.)


--- Variable: *emacs-major-version*


  The major version number of Emacs, as an integer. For Emacs version 23.1, the value is 23.


--- Variable: *emacs-minor-version*


  The minor version number of Emacs, as an integer. For Emacs version 23.1, the value is 1.


--- Variable: *emacs-build-number*


  An integer that increments each time Emacs is built in the same directory (without cleaning). This is only of relevance when developing Emacs.



